TexasInstruments/c2000ware-core-sdk/driverlib/f28003x/examples/fsi/fsi_ex16_daisy_handshake_node.c
      DEVICE_DELAY_US(10); // Wait some time for devices to get ready

      //
      // Signal next device in chain to be calibrated
      //
      FSI_signalNextCalibrate(FSIRXA_BASE, FSITXA_BASE, HANDSHAKE_PRESCALER_VAL, NextCalibrateTag);

      //
      // Current device transmits to calibrate next device in chain
      //
      FSI_transmitToCalibrate(FSIRXA_BASE, FSITXA_BASE, PRESCALER_VAL);

      //
      // Go into pass-through mode, forwarding frames received until
      //  FSI_FRAME_TAG15 is received signaling end of calibration
      //  sequence.
      //
      FSI_daisy_calibratePassThrough(FSIRXA_BASE, FSITXA_BASE,
                                 HANDSHAKE_PRESCALER_VAL, FSI_FRAME_TAG15);



  #endif

#endif
//     ESTOP0; Added for debug
#if FSI_RX_TDM_ENABLE == 1 && FSI_DELAY_LINE_CALIBRATION_ENABLE == 0

     FSI_enableTxTDMMode(FSITXA_BASE);
     FSI_enableRxTDMMode(FSITXA_BASE);

#endif
     // Set FSI TX clock to desired full speed now that handshake is complete
     FSI_configPrescalar(FSITXA_BASE, PRESCALER_VAL);
     DEVICE_DELAY_US(0.1);
     FSI_enableTxClock(FSITXA_BASE);

     // Set FSI TX buffer pointer to beginning
     FSI_setTxBufferPtr(FSITXA_BASE, 0U);

     // Set FSI RX buffer pointer to beginning
     FSI_setRxBufferPtr(FSIRXA_BASE, 0U);


    // Setting for requested nWords and nLanes with transfers
    //
    FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_NWORD_DATA);
    FSI_setTxSoftwareFrameSize(FSITXA_BASE, nWords);
    FSI_setTxDataWidth(FSITXA_BASE, nLanes);
    // RX setting part
    FSI_setRxSoftwareFrameSize(FSIRXA_BASE, nWords);
    FSI_setRxDataWidth(FSIRXA_BASE, nLanes);

    //
    // Enable transmit/receive error events to be sent over INT2 line
    // Overrun and Underrun conditions in Rx are not enabled as buffer pointers
    // are always overwritten to first location for sending data frames.
    //
    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT2, FSI_RX_EVT_CRC_ERR  |
                                                 FSI_RX_EVT_EOF_ERR  |
                                                 FSI_RX_EVT_TYPE_ERR);

    FSI_disableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_PING_FRAME);
    DEVICE_DELAY_US(10);

    FSI_enableTxInterrupt(FSITXA_BASE, FSI_INT1, FSI_TX_EVT_FRAME_DONE);

    #if FSI_DMA_ENABLE==0

    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_DATA_FRAME);

    #else

    //
    // Initialize the dma channels for both tx and rx buffers
    //
    DMA_initController();

    InitFrameTagAndData();

    fsirx_dma_config();

    FSI_setTxStartMode(FSITXA_BASE, FSI_TX_START_FRAME_CTRL_OR_UDATA_TAG);

    // Enable DMA event on FSI Rx
    FSI_enableRxDMAEvent(FSIRXA_BASE);

    // Start RX channels
    DMA_startChannel(DMA_CH3_BASE);
    DMA_startChannel(DMA_CH4_BASE);

    #endif

    //
    // Now, start transmitting data frames
    //
    while(1)
    {

    #if FSI_DMA_ENABLE==0

         //
        // Wait for RX data frame received event
        //
        while(fsiRxInt1Received != 1U);

        #if FSI_RX_TDM_ENABLE == 0

            while(fsiTxInt1Received != 1U); //When RX TDM is enabled, Tx interrupt is not received

        #endif
                fsiRxInt1Received = 0U;
                fsiTxInt1Received = 0U;

    #else

        //
        // Wait for RX channels to complete a transfer
        //
        while(dmaIntr2 == 0U); // RX Int flag
        dmaIntr2 = 0;

    #endif

    }
}

void handshake_node(void)
{

    while(1)
    {
        while(fsiRxInt1Received != 1);
        compare16(rxEventSts, (FSI_RX_EVT_PING_FRAME | FSI_RX_EVT_FRAME_DONE));
        checkReceivedFrameTypeTag(FSI_FRAME_TYPE_PING, FSI_FRAME_TAG0);
        //
        // If received frame type and tag matches, exit this loop and proceed to
        // next step by sending flush sequence, otherwise clear error and
        // interrupt flag and continue looping.
        //
        if(error == 0)
        {
            fsiRxInt1Received = 0;
            break;
        }

        fsiRxInt1Received = 0;
        error = 0;
    }

    while(1)
    {
        //
        // Send the flush sequence
        //
        FSI_executeTxFlushSequence(FSITXA_BASE, PRESCALER_VAL);

        //
        // Send a ping frame with frame tag 0000b
        //
        FSI_setTxFrameTag(FSITXA_BASE, FSI_FRAME_TAG0);
        FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_PING);
        FSI_startTxTransmit(FSITXA_BASE);

        while(fsiRxInt1Received != 1U && rxTimeOutCntr != 0U)
        {
            DEVICE_DELAY_US(1);
            rxTimeOutCntr--;
        }

        if(rxTimeOutCntr == 0)
        {
            rxTimeOutCntr = RX_TIME_OUT_CNTR;
            continue;
        }
        else
        {
            compare16(rxEventSts, (FSI_RX_EVT_PING_FRAME | FSI_RX_EVT_FRAME_DONE));
            checkReceivedFrameTypeTag(FSI_FRAME_TYPE_PING, FSI_FRAME_TAG1);
            //
            // If received frame type and tag matches, exit this loop and proceed
            // to next step by sending flush sequence, otherwise clear error and
            // interrupt flag and continue looping.
            //
            if(error == 0)
            {
                fsiRxInt1Received = 0;
                break;
            }

            fsiRxInt1Received = 0;
            error = 0;
        }
    }
    //
    // Send a ping frame with frame tag 0001b
    //
    FSI_setTxFrameTag(FSITXA_BASE, FSI_FRAME_TAG1);
    FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_PING);
    FSI_startTxTransmit(FSITXA_BASE);
    DEVICE_DELAY_US(10);
}

//
// initFSI - Initializes FSI Tx/Rx and also sends FLUSH sequence.
//
void initFSI(void)
{
    FSI_disableRxInternalLoopback(FSIRXA_BASE);

    //
    // NOTE: External loopback, Modify GPIO settings as per setup
    //
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_TXCLK);
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_TX0);

    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_RXCLK);
    GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_RX0);

    if(nLanes == FSI_DATA_WIDTH_2_LANE)
    {
        GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_TX1);
        GPIO_setPinConfig(DEVICE_GPIO_CFG_FSI_RX1);
    }

    //
    // Set RX GPIO to be asynchronous
    // (pass through without delay)
    // Default setting is to have 2 SYS_CLK cycles delay
    //
    if(nLanes == FSI_DATA_WIDTH_2_LANE)
    {
        GPIO_setQualificationMode(DEVICE_GPIO_PIN_FSI_RX1, GPIO_QUAL_ASYNC);
    }
    GPIO_setQualificationMode(DEVICE_GPIO_PIN_FSI_RX0, GPIO_QUAL_ASYNC);
    GPIO_setQualificationMode(DEVICE_GPIO_PIN_FSI_RXCLK, GPIO_QUAL_ASYNC);

